Repository: pigamux/pigamux.github.io
Catalog: games/aca/AdventuresWithAnxiety.tmx
Source language: en_us
Languages: pt_pt

source: b: <g id="1">But</g> if we open up, other people will see all our messed-up insides!
pt_pt: b: <g id="1">Mas</g> se nos abrirmos, as outras pessoas irão ver as nossas entranhas!

source: h: Roll over.
pt_pt: h: Rebola.

source: b: What.
pt_pt: b: O quê.

source: h: When dogs want to show love and trust, they make themselves vulnerable by exposing their belly.
pt_pt: h: Quando os cães querem mostrar amor e confiança, tornam-se vulneráveis ao expor a barriga.

source: h: Maybe we're not <g id="1">yet</g> secure enough to be too vulnerable, but with enough training,
pt_pt: h: Talvez <g id="1">ainda</g> não estejamos seguros o suficiente para sermos muito vulneráveis, mas com treino suficiente,

source: h: One day we can show people the real us – all messed-up, all human.
pt_pt: h: Um dia podemos mostrar às pessoas quem somos na realidade - todos confusos, todos humanos.

source: b: I'll roll over if you give me a treat.
pt_pt: b: Vou rebolar se me deres mimos.

source: h: No.
pt_pt: h: Não.

source: b: Saying "hi" to the barista isn't exactly gold-medal performance in the Social Butterfly Olympics.
pt_pt: b: Dizer "Olá" ao barista não é exatamente o desempenho de medalha de ouro nas Olimpíadas das Borboletas Sociais.

source: h: It is for <g id="1">us!</g>
pt_pt: h: Para <g id="1">nós é!</g>

source: h: In the social arena, we're not even featherweight class, we're like... quark-weight.
pt_pt: h: Na área social, nem do escalão dos "featherweight" somos, somos como... "quark-weight".

source: h: If we have to start with small, cheap wins, so be it.
pt_pt: h: Se tivermos de começar com vitórias pequenas, assim seja.

source: Gotta climb the 1st step before the 1000th step.
pt_pt: Há que subir o primeiro degrau antes do milésimo degrau.

source: b: Yeah!
pt_pt: b: Sim!

source: Maybe after saying "Hi", we can advance to saying...
pt_pt: Talvez depois de dizer "Olá", possamos avançar para um...

source: b: <g id="1">"How are you?"</g>
pt_pt: b: <g id="1">"Tudo bem?"</g>

source: h: <g id="1">"Not much!"</g>
pt_pt: h: <g id="1">"Nada demais!"</g>

source: b: Maybe the barista just wants to make some dang coffee, not be an <g id="1">experiment</g> to see if our social skills suck.
pt_pt: b: Talvez o barista só queira fazer o raio do café e não fazer parte de uma <g id="1">experiência</g> para ver se nossas habilidades sociais são más.

source: h: Well, if it turns out we <g id="1">are</g> being a burden...
pt_pt: h: Bem, se for óbvio que <g id="1">somos</g> um inconveniente...

source: h: That's good to know, too!
pt_pt: h: É bom que o saibamos também!

source: h: We can then learn how to pro-actively ask people what they're comfortable with, to know and respect others' boundaries.
pt_pt: h: Mais tarde podemos aprender a perguntar proactivamente às pessoas aquilo com que se sentem confortáveis, para saber e respeitar os limites delas.

source: h: Y'know, all that "inter-personal skills" ^crap^ we see in counselor brochures.
pt_pt: h: Tu sabes, aquela ^merda^ de "habilidades interpessoais" que vemos nos panfletos.

source: b: I want to defend your moral needs, that drive to become a better person,
pt_pt: b: Eu quero defender as tuas necessidades morais, essa vontade de ter tornares uma pessoa melhor,

source: b: But it just feels like deep down, we're so fundamentally... broken.
pt_pt: b: Mas parece que, no fundo, estamos tão fundamentalmente... despedaçados.

source: INJURED}} b: And don't tell me we're <g id="1">not</g> messed up.
pt_pt: MAGOADO}} b: E não me digas que <g id="1">não</g> estamos confusos.

source: We jumped off a <g id="2">roof</g>. {{/if}}
pt_pt: Saltamos de um <g id="2">telhado</g>. {{/if}}

source: We almost jumped off a <g id="2">roof</g>. {{/if}}
pt_pt: Quase saltamos de um <g id="2">telhado</g>. {{/if}}

source: So we're broken.
pt_pt: Então estamos despedaçados.

source: Let's fix us.
pt_pt: Vamos consertar-nos.

source: Let's accept it.
pt_pt: Vamos aceitar isso.

source: h: We could slowly build better habits, get our life more in line with what we value,
pt_pt: h: Podemos ir construindo hábitos melhores, colocar a nossa vida mais alinhada com o que valorizamos,

source: h: And if needed, we could get professional help – a therapist or counsellor.
pt_pt: h: E se necessário, podemos arranjar ajuda profissional - um terapeuta ou conselheiro.

source: h: There's ways to fix us.
pt_pt: h: Existem maneiras de nos consertar.

source: What if we can't fix it all?
pt_pt: E se não conseguirmos consertar tudo?

source: What if we fix <g id="2">too</g> much?
pt_pt: E se consertarmos em <g id="2">demasia</g>?

source: We can't afford professional help.
pt_pt: Não podemos pagar ajuda profissional.

source: h: Nah, I guess you're right.
pt_pt: h: Não, acho que tens razão.

source: h: We can't fix it all.
pt_pt: h: Não podemos consertar tudo.

source: b: Ahhh I knew it we'll always be broken!
pt_pt: b: Ahhh eu sabia que ficaríamos despedaçados para sempre!

source: h: But we can at least be <g id="1">less</g> broken.
pt_pt: h: Mas podemos, pelo menos, ser "não <g id="1">tão</g> " despedaçados.

source: h: Scars heal with time, but they never go away.
pt_pt: h: As cicatrizes curam com o tempo, mas nunca desaparecem.

source: And that's okay.
pt_pt: E não há problema.

source: b: I guess.
pt_pt: b: Acho eu.

source: Besides,
pt_pt: Além disso,

source: b: Scars are <g id="1">sexy.</g>
pt_pt: b: Cicatrizes são <g id="1">sexy.</g>

source: h: Please do not do that.
pt_pt: h: Por favor, não faças isso.

source: b: This feels sick to admit, but... some part of me <g id="1">wants</g> to have this disorder.
pt_pt: b: É doentio admitir, mas... parte de mim <g id="1">quer</g> ter este transtorno.

source: b: I mean, without it, won't we be <g id="1">boring?</g>
pt_pt: b: Quer dizer, sem ele, não seríamos <g id="1">aborrecidos?</g>

source: b: Without the disorder, won't our art become stale and bland?
pt_pt: b: Sem a desordem, a nossa arte não se tornaria obsoleta e sem graça?

source: b: Without the disorder, won't we be unable to connect with our friends who have the disorder?
pt_pt: b: Sem o transtorno, não seríamos incapazes de nos conectar com os nossos amigos que têm o transtorno?

source: b: If we're ever content with life, won't we stop driving ourselves to do great things?
pt_pt: b: Se estivermos sempre contentes com a vida, não vamos parar de nos esforçar para fazer coisas extraordinárias?

source: h: If we even fear... "running out of fears"...
pt_pt: h: Se tivermos medo de ... "esgotar os nossos medos" ...

source: h: I don't think we're gonna run out of fears.
pt_pt: h: Eu não acho que vamos ficar sem medos.

source: b: Oh, yeah!
pt_pt: b: Oh, sim!

source: Whew!
pt_pt: Ufa!

source: What a relief!
pt_pt: Que alivio!

source: b: "Doc, I'm anxious that I'm paying $100/hr just to hear you ask <g id="1">how does that make you feel?</g>"
pt_pt: b: "Doutor, estou ansioso por pagar 100€ à hora só para o ouvir perguntar "<g id="1">Como é que isso te faz sentir"?</g>"

source: And how does that make you feel?"
pt_pt: E como é que isso te faz sentir?

source: h: Nah, that's a totally reasonable worry.
pt_pt: h: Nah, essa é uma preocupação totalmente razoável.

source: h: And it genuinely sucks that mental healthcare isn't affordable for lots of folks.
pt_pt: h: E é realmente uma pena que a saúde mental não seja acessível para muitas pessoas.

source: h: Still, there are some cheap or free options:
pt_pt: h: Ainda assim, existem algumas opções baratas ou gratuitas:

source: h: Support groups, online therapy, student/non-profit health centers...
pt_pt: h: Grupos de apoio, terapia online, centros de saúde estudantis / sem fins lucrativos...

source: h: Building habits like meditation, sleeping well, chatting regularly with friends, learning new things...
pt_pt: h: Construir hábitos como meditação, dormir bem, conversar regularmente com amigos, aprender coisas novas ...

source: h: Going to a library to borrow workbooks for evidence-based psychotherapies...
pt_pt: h: Ir à biblioteca buscar livros de exercícios para psicoterapias baseadas em evidências ...

source: h: There's a full list of resources at the end of this game!
pt_pt: h: Há uma lista completa de recursos no final deste jogo!

source: b: Well <g id="1">that</g> fourth wall didn't last long.
pt_pt: b: Bem, <g id="1">esta</g> "fourth wall" não durou muito.

source: h: Some things are more important than narrative convention.
pt_pt: h: Algumas coisas são mais importantes do que a convenção narrativa.

source: Such as mental health.
pt_pt: Como a saúde mental.

source: h: I mean, that's what therapists say right?
pt_pt: h: Quer dizer, é isso que dizem os terapeutas, certo?

source: Accept all your emotions, even the negative ones?
pt_pt: Aceita todas as tuas emoções, mesmo as negativas?

source: b: Wait.
pt_pt: b: Espera.

source: "Accept" as in <g id="2">give up</g>?
pt_pt: "Aceitar" como em <g id="2">liberta-te delas</g>?

source: "Accept" as in <g id="2">approve</g>?
pt_pt: "Aceitar" como em <g id="2">aprova-as</g>?

source: "Accept" as in <g id="2">take literally</g>?
pt_pt: "Aceitar" como em leva-as <g id="2">a sério</g>?

source: b: Do you think Martin Luther King would've said, "Shucks we can't sit in the front of the bus, let's just <g id="1">accept</g> it?"
pt_pt: b: Achas que o Martin Luther King teria dito: "É uma ^merda^ não nos podermos sentar na parte da frente do autocarro, vamos só <g id="1">aceitar</g> ?"

source: b: Why does the Self-Help Industrial Complex think waving the white flag is some <g id="1">profound wisdom?</g>
pt_pt: b: Porque é que o Complexo Industrial de Autoajuda acha que acenar a bandeira branca é <g id="1">sabedoria profunda?</g>

source: h: I think therapists mean "accept" bad things as in: acknowledging they exist and are hard to change,
pt_pt: h: Eu acho que os terapeutas querem dizer "aceitar" coisas más como em: reconhecer que existem e são difíceis de mudar,

source: h: But not necessarily giving up a commitment to change.
pt_pt: h: Mas não necessariamente desistir de um compromisso com a mudança.

source: b: Then therapists should say <g id="1">acknowledge</g>, not <g id="2">accept</g>.
pt_pt: b: Então os terapeutas devem dizer <g id="1">reconhecer</g>, não <g id="2">aceitar</g>.

source: h: Yeah come to think of it, "accept" is kinda confusing.
pt_pt: h: Sim, pensando bem, "aceitar" é meio confuso.

source: b: Well, I <g id="1">acknowledge</g> that.
pt_pt: b: Bem, eu <g id="1">reconheço</g> isso.

source: b: Like it's <g id="1">good</g> that we're broken or something?
pt_pt: b: Como é <g id="1">bom</g> estarmos despedaçados ou algo assim?

source: No!
pt_pt: Não!

source: b: All those dang Hollywood screenwriters who romanticize mental illness are full of crud!
pt_pt: b: Todos aqueles malditos argumentistas de Hollywood que romantizam doenças mentais estão cheios de crudes!

source: b: Having a mental disorder <g id="1">sucks!</g>
pt_pt: b: Ter um transtorno mental é uma ^<g id="1">merda^!</g>

source: It robs people of <g id="2">lives!</g>
pt_pt: Rouba <g id="2">vida às pessoas!</g>

source: Why should we "accept" that?!
pt_pt: Porque é que devemos "aceitar" isso?!

source: h: I think therapists mean "accept" our emotions as in: be patient with them.
pt_pt: h: Acho que terapeutas querem dizer "aceitar" as nossas emoções como em: sejam pacientes com elas.

source: h: Like how struggling in quicksand makes you sink faster, and the solution is to patiently lie flat,
pt_pt: h: Por exemplo, da mesma maneira que mexermo-nos em areia movediça nos faz afundar mais rápido, e a solução é ficar pacientemente quieto,

source: INJURED}} h: Fighting against you, my fear, led me to jump off a roof. {{/if}}
pt_pt: MAGOADO}} h: Lutar contra ti, o meu medo, levou-me a saltar de um telhado. {{/if}}

source: INJURED}} h: Fighting against you, my fear, almost led me to jump off a roof. {{/if}}
pt_pt: MAGOADO}} h: Lutar contra ti, o meu medo, quase me levou a saltar de um telhado. {{/if}}

source: h: Instead, the solution is to do what we're doing now – not to fight, but to patiently be with each other.
pt_pt: h: Em vez disso, a solução é fazer o que estamos a fazer agora - não lutar, mas estar pacificamente um com o outro.

source: b: Then they should say <g id="1">that</g> instead of some problematic word like "accept".
pt_pt: b: Então eles deviam dizer <g id="1">isso</g> em vez de uma palavra tão problemática como "aceitar".

source: h: Yeah come to think of it, "accept" kind of sucks.
pt_pt: h: Sim, pensando bem, "aceitar" é uma ^merda^.

source: b: I do not accept "accept".
pt_pt: b: Não aceito "aceitar".

source: b: But we already <g id="1">know</g> you shouldn't take me literally!
pt_pt: b: Mas já <g id="1">sabemos</g> que não deves levar-me a sério!

source: b: The whole <g id="1">problem</g> is that I want to help you, but I suck at using words to do so!
pt_pt: b: O <g id="1">problema</g> é que eu quero ajudar-te, mas sou péssimo a usar palavras para fazer isso!

source: h: I think therapists mean "accept" your emotions as in: "don't fight or ignore them."
pt_pt: h: Acho que os terapeutas querem dizer "aceitar" as emoções como em: "não lutes com elas nem as ignores".

source: h: To listen to you, work <g id="1">with</g> you, but not take what you say as 100% literal truth.
pt_pt: h: Para te ouvir, trabalhar <g id="1">contigo</g> , mas não tomar o que dizes como uma verdade 100% literal.

source: b: Then therapists should say <g id="1">that</g> instead of some vague confusing word like "accept".
pt_pt: b: Então os terapeutas deviam dizer <g id="1">isso</g> em vez de uma palavra tão confusa e vaga como "aceitar".

source: h: I guess they suck at using words, too.
pt_pt: h: Eu acho que eles também são péssimos no que toca ao uso de palavras.

source: {{if _.a4_fears_discussed==1}} h: Anyway, anything else you wanna chat about?
pt_pt: {{if _.a4_fears_discussed==1}} h: Enfim, queres falar de mais alguma coisa?

source: {{if _.a4_fears_discussed==2}} h: So, anything else on your heavy heart?
pt_pt: {{if _.a4_fears_discussed==2}} h: Então, há mais alguma coisa a pesar nesse teu coração?

source: {{if _.a4_talked_about_harm!=true}} <g id="1">I'm scared we'll be harmed.</g> {{/if}}
pt_pt: {{if _.a4_talked_about_harm!=true}} <g id="1">Estou com medo de sermos magoados.</g> {{/if}}

source: {{if _.a4_talked_about_alone!=true}} <g id="1">I'm scared we'll be alone.</g> {{/if}}
pt_pt: {{if _.a4_talked_about_alone!=true}} <g id="1">Estou com medo de ficarmos sozinhos.</g> {{/if}}

source: {{if _.a4_talked_about_bad!=true}} <g id="1">I'm scared we're bad people.</g> {{/if}}
pt_pt: {{if _.a4_talked_about_bad!=true}} <g id="1">Estou com medo de que sejamos más pessoas.</g> {{/if}}

source: Nah, I'm good for now.
pt_pt: Nah, estou bem por agora.

source: h: Okay, I think we've talked about all our fears now.
pt_pt: h: Ok, acho que já falamos sobre todos os nossos medos.

source: b: Yes, there are only three fears.
pt_pt: b: Sim, existem apenas três medos.

source: h: Yup, exactly three.
pt_pt: h: Sim, exatamente três.

source: b: Convenient.
pt_pt: b: Conveniente.

source: h: Good chat, team.
pt_pt: h: Boa conversa equipa.

source: b: This isn't some <g id="1">game</g>, you know.
pt_pt: b: Isto não é um <g id="1">jogo</g>, sabes.

source: b: Building a healthy relationship with your emotions isn't as simple as clicking buttons on a screen.
pt_pt: b: Construir um relacionamento saudável com as tuas emoções não é tão simples como clicar em botões numa tela.

source: b: <g id="1">Can</g> we really get along?
pt_pt: b: <g id="1">Podemos</g> mesmo dar-nos bem?

source: b: <g id="1">Can</g> we work together, as a team?
pt_pt: b: <g id="1">Podemos</g> trabalhar juntos, como uma equipa?

source: h: Well,
pt_pt: h: Bem,

source: a: E-excuse me...
pt_pt: a: C-com licença ...

source: a: W-wo-would you mind if I sat with you for lunch?
pt_pt: a: I-i-importas-te que me sente contigo para almoçar?

source: TOP_FEAR=="harm"}} s: <g id="1">This</g> is your crush?
pt_pt: TOP_FEAR == "harm"}} s: <g id="1">É este</g> o teu crush?

source: Why are they sitting alone like a psycho serial killer?
pt_pt: Porque é que está sentado sozinho como um psicopata?

source: TOP_FEAR=="alone"}} s: Asking your crush if you can sit with them?
pt_pt: TOP_FEAR == "alone"}} s: A perguntar ao teu crush se te podes sentar com ele?

source: Do you know how <g id="1">needy</g> we sound?!
pt_pt: Tens noção do quão <g id="1">carente</g> pareces?!

source: TOP_FEAR=="bad"}} s: <g id="1">This</g> is your crush?
pt_pt: TOP_FEAR == "bad"}} s: <g id="1">É este</g> o teu crush?

source: We interrupted their peace and quiet!
pt_pt: Interrompemos paz e sossego dele!

source: We're such a burden!
pt_pt: Somos tão inconvenientes!

source: a: I- I mean- it's, it's okay if not, I just...
pt_pt: a: Q-q-quer dizer- es-está tudo bem se não puder, eu só...

source: <g id="1">Wait, didn't I see you at the party?</g>
pt_pt: <g id="1">Espera, não te vi na festa?</g>

source: Yeah, of course!
pt_pt: Sim, claro!

source: Come here.<ex id="_1"/> <g id="2">publish("act4", ["hong_to_alshire",2])</g>
pt_pt: Vem cá.<ex id="_1"/> <g id="2">publish("act4", ["hong_to_alshire",2])</g>

source: <g id="1">Sorry, I need alone time right now.</g> <g id="2">publish("act4", ["hong_to_alshire",8])</g>
pt_pt: <g id="1">Desculpa, preciso de um tempo sozinho agora.</g> <g id="2">publish("act4", ["hong_to_alshire", 8])</g>

source: h2: Yeah you were on the couch!
pt_pt: h2: Sim, estavas no sofá!

source: At the first party I went to...
pt_pt: Na primeira festa a que fui...

source: {{if _.a2_ending=="fight"}} h2: Where I had that panic attack and punched the host. {{/if}}
pt_pt: {{if _.a2_ending=="fight"}} h2: Onde tive aquele ataque de pânico e dei um soco ao anfitrião. {{/if}}

source: {{if _.a2_ending=="flight"}} h2: Where I had that panic attack and ran out crying. {{/if}}
pt_pt: {{if _.a2_ending=="flight"}} h2: Onde tive aquele ataque de pânico e fugi a chorar. {{/if}}

source: b: Hang on human, we may be making them uncomfortable.
pt_pt: b: Espera, humano, podemos estar a deixá-la desconfortável.

source: h2: Ah, I don't mean to put you on the spot!
pt_pt: h2: Ah, não é a minha intenção deixá-la desconfortável!

source: h2: Just remembering a friendly face, is all.
pt_pt: h2: Estou apenas a relembrar-me de um rosto amigo, só isso.

source: TOP_FEAR=="harm"}} s: AHHHHH I KNEW IT!
pt_pt: TOP_FEAR == "harm"}} s: AHHHHH EU SABIA!

source: THEY'RE A DANGEROUS PANIC-DRIVEN PSYCHO!
pt_pt: ALERTA: PSICOPATA PERIGOSO EM PÂNICO!

source: TOP_FEAR=="alone"}} s: AAHHH THE FIRST IMPRESSION WE MADE WAS "WITNESSED MY TRAUMA"!
pt_pt: TOP_FEAR == "alone"}} s: AAHHH A PRIMEIRA IMPRESSÃO QUE FIZEMOS FOI "TESTEMUNHASTE O MEU TRAUMA"!

source: THAT MEANS THEY HATE US!
pt_pt: Isso significa que nos odeia!

source: TOP_FEAR=="bad"}} s: AAAHHH WE MADE SOMEONE REMEMBER A TRAUMATIC EVENT.
pt_pt: TOP_FEAR == "bad"}} s: AAAHHH FIZEMOS ALGUÉM LEMBRAR-SE DE UM EVENTO TRAUMÁTICO.

source: OUR MERE PRESENCE HURTS OTHERS. {{/if}}
pt_pt: SÓ A NOSSA PRESENÇA JÁ MAGOA OS OUTROS. {{/if}}

source: b: Hang on human, they seem uncomfortable.
pt_pt: b: Espera, humano, ela parece desconfortável.

source: h2: Ah, no pressure of course!
pt_pt: H2: Ah, sem pressão, é claro!

source: h2: Just saying, you can sit here if you want to.
pt_pt: h2: Podes sentar-te aqui se quiseres.

source: TOP_FEAR=="harm"}} s: THEY'RE BEING <g id="1">TOO</g> FRIENDLY!
pt_pt: TOP_FEAR == "harm"}} s: ESTÁ A SER <g id="1">DEMASIADO</g> AMIGÁVEl!

source: LIKE TED BUNDY, THE SERIAL KILLER!
pt_pt: IGUALZINHO AO TED BUNDY, O ASSASSINO!

source: TOP_FEAR=="alone"}} s: THEY'RE JUST ACTING NICE!
pt_pt: TOP_FEAR == "alone"}} s: ESTÁ SÓ A FINGIR SER SIMPÁTICO!

source: NO ONE <g id="1">REALLY</g> WANTS TO BE CLOSE TO US!
pt_pt: NINGUÉM QUER, <g id="1">REALMENTE</g> , ESTAR PERTO DE NÓS!

source: TOP_FEAR=="bad"}} s: AHHH WE ALWAYS MAKE OTHERS FEEL AWKWARD!
pt_pt: TOP_FEAR == "bad"}} s: AHHH NÓS FAZEMOS SEMPRE OS OUTROS SENTIREM-SE ESQUISITOS!

source: WE'RE A STAIN UPON THE EARTH!
pt_pt: SOMOS TÃO DESAGRADÁVEIS!

source: h2: Ah, I don't mean to be rude!
pt_pt: h2: Ah, não quero ser rude!

source: h2: I just need some time to process my emotions.
pt_pt: h2: Só preciso de algum tempo para processar as minhas emoções.

source: Please don't take it as a personal rejection.
pt_pt: Por favor, não leves isto como uma rejeição pessoal.

source: TOP_FEAR=="harm"}} s: WHAT SICK, TWISTED THOUGHTS ARE THEY PROCESSING?!
pt_pt: TOP_FEAR == "harm"}} s: QUE PENSAMENTOS DOENTIOS E TORCIDOS ESTÁ A PROCESSAR?!

source: WHAT DARK DESIRES FILL THIS PSYCHO'S HEART?!
pt_pt: QUE DESEJOS OBSCUROS PREENCHEM O CORAÇÃO DESTE PSICOPATA?!

source: TOP_FEAR=="alone"}} s: WE'VE BEEN PERSONALLY REJECTED!
pt_pt: TOP_FEAR == "alone"}} s: FOMOS REJEITADOS!

source: WE'LL NEVER BE LOVED!
pt_pt: NUNCA SEREMOS AMADOS!

source: TOP_FEAR=="bad"}} s: WE INTERRUPTED THEIR EMOTIONAL PROCESSING!
pt_pt: TOP_FEAR == "bad"}} s: INTERROMPEMOS O PROCESSAMENTO EMOCIONAL DELES!

source: NOW THEY'LL BE TRAUMATIZED FOREVER AND IT'S ALL OUR FAULT!
pt_pt: AGORA ESTÁ TRAUMATIZADOS PARA SEMPRE E É TUDO CULPA NOSSA!

source: s: RUN RUN RUN RUN RUN RUN RUN RUN RUN RUN RUN RUN RUN RUN RUN
pt_pt: s: FOGE FOGE FOGE FOGE FOGE FOGE FOGE FOGE FOGE FOGE

source: That was weird.
pt_pt: Aquilo foi estranho.

source: I wonder what was going on in their head.
pt_pt: Pergunto-me sobre o que estava a passar-lhe pela cabeça.

source: h: Anyway, you were saying?
pt_pt: h: Enfim, o que estavas a dizer?

source: b: Uh, I forget?
pt_pt: b: Uh, esqueci-me?

source: Something about teams and work?
pt_pt: Algo sobre equipas e trabalho?

source: b: They say you should "make peace" with your emotions, as if your emotions are <g id="1">war criminals</g>.
pt_pt: b: Dizem que deves "fazer as pazes" com as tuas emoções, como se as tuas emoções fossem <g id="1">criminosos</g>.

source: b: But I want us to make <g id="1">more</g> than mere peace!
pt_pt: b: Mas eu quero que façamos <g id="1">mais</g> do que a mera paz!

source: I want us to be <g id="2">allies!</g>
pt_pt: Eu quero que sejamos <g id="2">aliados!</g>

source: b: I want to be a good guard-dog.
pt_pt: b: Eu quero ser um bom Cão de Guarda.

source: Just like how hunger & thirst are alarms for your physical needs,
pt_pt: Assim como a fome e a sede são alarmes para as tuas necessidades físicas,

source: b: I want to be the alarm for your <g id="1">psychological</g> needs – your needs for safety, belonging, goodness.
pt_pt: b: Eu quero ser o alarme para as tuas necessidades <g id="1">psicológicas</g> - as tuas necessidades de segurança, pertencimento, bondade.

source: b: But...
pt_pt: "Mas...

source: I suck at my job, so I need you to train me.
pt_pt: Eu sou péssimo no meu trabalho, então preciso que me treines.

source: b: I'm not "always valid," nor "always irrational."
pt_pt: b: Não sou "sempre válido", nem "sempre irracional".

source: I'm just... trying my best.
pt_pt: Estou apenas ... a dar o meu melhor.

source: So, please,
pt_pt: Então, por favor…

source: b: Help me help you!
pt_pt: b: Ajuda-me a ajudar-te!

source: b: Though, teaching an old dog new tricks <g id="1">will</g> take a while.
pt_pt: b: Porém, ensinar truques novos a um cão velho <g id="1">vai</g> demorar um pouco.

source: Maybe <g id="2">years.</g>
pt_pt: Talvez <g id="2">anos.</g>

source: b: And sometimes I'll relapse, I'll slip into my old habits.
pt_pt: b: E às vezes vou ter uma recaída, vou cair nos meus velhos hábitos.

source: b: I'll bark at shadows.
pt_pt: b: Vou latir a sombras.

source: I'll scare you with words.
pt_pt: Vou assustar-te com palavras.

source: I might even show you some intrusive images of... things.
pt_pt: Posso até mostrar-te algumas imagens intrusivas de... coisas.

source: b: I'm sorry!
pt_pt: Desculpa.
